## Ejemplo 3: Funciones vectorizadas y agregaciones con `DataFrames`

### 1. Objetivos:
    - Aprender cómo usar Funciones vectorizadas y agregaciones aplicadas a `DataFrames` completos
 
---
    
### 2. Desarrollo:

In [1]:
import pandas as pd

Tenemos los siguientes datos y su correspondiente DataFrame:

In [2]:
datos = {
    'precio': [34, 54, 223, 78, 56, 12, 34],
    'cantidad_en_stock': [3, 6, 10, 2, 5, 45, 2],
    'productos_vendidos': [3, 45, 23, 76, 24, 6, 2]
}

df = pd.DataFrame(datos,
    index=["Pokemaster", "Cegatron", "Pikame Mucho",
           "Lazarillo de Tormes", "Stevie Wonder",
           "Needle", "El AyMeDuele"])

In [3]:
df

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster               34                  3                   3
Cegatron                 54                  6                  45
Pikame Mucho            223                 10                  23
Lazarillo de Tormes      78                  2                  76
Stevie Wonder            56                  5                  24
Needle                   12                 45                   6
El AyMeDuele             34                  2                   2

Si aplicamos operaciones aritméticas a nuestro `DataFrame` la operación se aplicará elemento por elemento a nuestro `DataFrame` completo, por ejemplo multiplica por 100 todos los valores del DataFrame:

In [4]:
# tu código
df * 100

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster             3400                300                 300
Cegatron               5400                600                4500
Pikame Mucho          22300               1000                2300
Lazarillo de Tormes    7800                200                7600
Stevie Wonder          5600                500                2400
Needle                 1200               4500                 600
El AyMeDuele           3400                200                 200

Ahora suma 100 y divide por 2:

In [5]:
# tú código
(df + 100 ) / 2

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster             67.0               51.5                51.5
Cegatron               77.0               53.0                72.5
Pikame Mucho          161.5               55.0                61.5
Lazarillo de Tormes    89.0               51.0                88.0
Stevie Wonder          78.0               52.5                62.0
Needle                 56.0               72.5                53.0
El AyMeDuele           67.0               51.0                51.0

Eleva al cuadrado todos los valores del DataFrame

In [6]:
# tu código
df ** 2

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster             1156                  9                   9
Cegatron               2916                 36                2025
Pikame Mucho          49729                100                 529
Lazarillo de Tormes    6084                  4                5776
Stevie Wonder          3136                 25                 576
Needle                  144               2025                  36
El AyMeDuele           1156                  4                   4

También podemos aplicar funciones vectorizadas con el mismo resultado:

In [7]:
import numpy as np

Eleva al cuadrado usando la función vectorizadas de NumPy `np.power(-dataframe-,-potencia-)`:

In [8]:
# tu código
np.power(df,2)

                     precio  cantidad_en_stock  productos_vendidos
Pokemaster             1156                  9                   9
Cegatron               2916                 36                2025
Pikame Mucho          49729                100                 529
Lazarillo de Tormes    6084                  4                5776
Stevie Wonder          3136                 25                 576
Needle                  144               2025                  36
El AyMeDuele           1156                  4                   4

O se puede obtener la raíz cuadrada usando la función vectorizadas de NumPy `np.sqrt(-dataframe-)`:

In [9]:
# tu código
np.sqrt(df)

                        precio  cantidad_en_stock  productos_vendidos
Pokemaster            5.830952           1.732051            1.732051
Cegatron              7.348469           2.449490            6.708204
Pikame Mucho         14.933185           3.162278            4.795832
Lazarillo de Tormes   8.831761           1.414214            8.717798
Stevie Wonder         7.483315           2.236068            4.898979
Needle                3.464102           6.708204            2.449490
El AyMeDuele          5.830952           1.414214            1.414214

También se puede aplicar la siguiente fórmula a todos los elementos `sen(x) + 100`:

In [10]:
# tu código
np.sin(df) + 100

                         precio  cantidad_en_stock  productos_vendidos
Pokemaster           100.529083         100.141120          100.141120
Cegatron              99.441211          99.720585          100.850904
Pikame Mucho         100.053053          99.455979           99.153780
Lazarillo de Tormes  100.513978         100.909297          100.566108
Stevie Wonder         99.478449          99.041076           99.094422
Needle                99.463427         100.850904           99.720585
El AyMeDuele         100.529083         100.909297          100.909297

Si usamos agregaciones, las agregaciones se hacen de manera automática por columna, por ejemplo `dataframe.sum()`:

In [14]:
# tu código
suma_columnas = df.sum()
suma_columnas

precio                491
cantidad_en_stock      73
productos_vendidos    179
dtype: int64

Y si aplicamos nuevamente la suma a la variable `suma_columnas`:

In [15]:
suma_columnas.sum()

743

O se podría aplicar de forma secuencial `dataframe.sum().sum()`:

In [16]:
# tu código
df.sum().sum()

743

Aunque podemos cambiar ese comportamiento usando `dataframe.sum(axis=1)` para hacerlo por filas:

In [17]:
# tu código
df.sum(axis = 1)

Pokemaster              40
Cegatron               105
Pikame Mucho           256
Lazarillo de Tormes    156
Stevie Wonder           85
Needle                  63
El AyMeDuele            38
dtype: int64

Todas las demás agregaciones funcionan también. El default (o `axis=0`) es hacerlo por columna, pero todas pueden funcionar por fila usando `axis=1`, por ejemplo se puede obtener el mínimo de cada columna usando `axis=0` o por filas usando `axis=1`

In [18]:
# mínimo por columnas
df.min()

precio                12
cantidad_en_stock      2
productos_vendidos     2
dtype: int64

In [19]:
# mínimo por filas
df.min( axis = 1)

Pokemaster              3
Cegatron                6
Pikame Mucho           10
Lazarillo de Tormes     2
Stevie Wonder           5
Needle                  6
El AyMeDuele            2
dtype: int64

---
---

## Reto 3: Agregaciones con `DataFrames`

### 1. Objetivos:
    - Aplicar agregaciones a `DataFrames` completos para obtener un análisis estadístico
 
---
    
### 2. Desarrollo:

#### a) Análisis estadístico con agregaciones

Eres el Analista de Datos de EyePoker Inc. Te han pedido que realices ciertas agregaciones con un conjunto de datos para poder realizar un análisis estadístico básico de los datos que hay dentro.

El conjunto de datos es el siguiente:

In [21]:
import pandas as pd

In [22]:
datos = {
    'producto': ["Pokemaster", "Cegatron", "Pikame Mucho", "Lazarillo de Tormes", "Stevie Wonder", "Needle", "El AyMeDuele", "El Desretinador", "Sacamel Ojocles", "Desojado", "Maribel Buenas Noches", "Cíclope", "El Cuatro Ojos"],
    'precio': [12000, 5500, 2350, 4800, 8900, 6640, 1280, 1040, 23100, 16700, 15000, 13400, 19600],
    'cantidad_en_stock': [34, 54, 36, 78, 56, 12, 34, 4, 0, 18, 45, 23, 5],
    'cantidad_vendidos': [120, 34, 59, 9, 15, 51, 103, 72, 39, 23, 10, 62, 59]
}

df = pd.DataFrame(datos)

In [23]:
df

                 producto  precio  cantidad_en_stock  cantidad_vendidos
0              Pokemaster   12000                 34                120
1                Cegatron    5500                 54                 34
2            Pikame Mucho    2350                 36                 59
3     Lazarillo de Tormes    4800                 78                  9
4           Stevie Wonder    8900                 56                 15
5                  Needle    6640                 12                 51
6            El AyMeDuele    1280                 34                103
7         El Desretinador    1040                  4                 72
8         Sacamel Ojocles   23100                  0                 39
9                Desojado   16700                 18                 23
10  Maribel Buenas Noches   15000                 45                 10
11                Cíclope   13400                 23                 62
12         El Cuatro Ojos   19600                  5                 59

Tu tarea es muy simple. Usando métodos de agregación, asigna las variables de la siguiente celda con los resultados de agregar nuestro `DataFrame` **por columna** usando cada una de las medidas estadísticas. Algunas de los métodos ya los conoces. Los que no, [puedes encontrarlos en este link](https://www.interactivechaos.com/manual/tutorial-de-pandas/dataframes-metodos-de-agregacion-y-estadistica). Lo que queremos obtener es una `Serie` con los nombres de las columnas como índice y las agregaciones por columna como valores. Una de las columnas que tenemos en el `DataFrame` no se presta para realizar análisis numéricos, elimínala antes de realizar tu análisis y asigna el resultado a la variable `df_droppped`.

**Sólo** utiliza funciones de agregación para tu análisis. En este caso no requieres hacer ninguna operación aritmética.

In [42]:
# Eliminando columna
df_dropped = df.drop(columns = ['producto'])
df_dropped
# El valor mínimo de cada columna
mins = df_dropped.min()
mins

precio               1040
cantidad_en_stock       0
cantidad_vendidos       9
dtype: int64

In [43]:
# El valor máximo de cada columna
maxs = df_dropped.max()
maxs

precio               23100
cantidad_en_stock       78
cantidad_vendidos      120
dtype: int64

In [44]:
# El promedio por columna
means = df_dropped.mean()
means

precio               10023.846154
cantidad_en_stock       30.692308
cantidad_vendidos       50.461538
dtype: float64

In [45]:
# La mediana por columna (El valor que se encuentra a la mitad de la secuencia ordenada de valores)
medians = df_dropped.median()
medians

precio               8900.0
cantidad_en_stock      34.0
cantidad_vendidos      51.0
dtype: float64

In [46]:
# La desviación estándar por columna
stds = df_dropped.std()
stds

precio               7210.205196
cantidad_en_stock      23.382275
cantidad_vendidos      34.289492
dtype: float64